---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
source: html/1bdd9c40-15b8-4d3b-760c-a6d4a8abbda7.htm
---
# PipeFittingAndAccessoryData Properties

The behavior type of the pipe fitting or pipe accessory.